## Plans :heavy_multiplication_x:

Running plans **FAILED**.  See **Terrateam Plan Output**.

After resolving the issue, run `terrateam plan` to execute the plan operation again.

## Terrateam Plan Output :heavy_multiplication_x:
<details>
  <summary>Expand for plan output details</summary>

<details>
  <summary><h3>Pre Hooks</h3></summary>

**Step**: oidc
**Success**: :thumbsup:
```

```
</details>

<details>
  <summary><h3>Post Hooks</h3></summary>

</details>


## Dir: policy-check | :heavy_multiplication_x:
**Dir**: policy-check
**Workspace**: default
**Success**: :heavy_multiplication_x:

**Step**: run
**Success**: :thumbsup:
**Details**: `terraform init`
```

Initializing the backend...

Initializing provider plugins...
- Finding latest version of hashicorp/aws...
- Finding latest version of hashicorp/random...
- Installing hashicorp/aws v5.70.0...
- Installed hashicorp/aws v5.70.0 (signed by HashiCorp)
- Installing hashicorp/random v3.6.3...
- Installed hashicorp/random v3.6.3 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

```
**Step**: plan
**Success**: :thumbsup:
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.vulnerable_bucket will be created
  + resource "aws_s3_bucket" "vulnerable_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Dev"
          + "Name"        = "Vulnerable S3 Bucket"
        }
      + tags_all                    = {
          + "Environment" = "Dev"
          + "Name"        = "Vulnerable S3 Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + lifecycle_rule {
          + enabled = true
          + id      = (known after apply)

          + expiration {
              + days = 365
            }

          + transition {
              + days          = 30
              + storage_class = "GLACIER"
            }
        }

      + logging {}

      + versioning {
          + enabled    = false
          + mfa_delete = false
        }
    }

  # random_id.bucket_id will be created
  + resource "random_id" "bucket_id" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + bucket_name = (known after apply)
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.vulnerable_bucket,
│   on main.tf line 2, in resource "aws_s3_bucket" "vulnerable_bucket":
│    2: resource "aws_s3_bucket" "vulnerable_bucket" {
│ 
│ Use the aws_s3_bucket_logging resource instead
│ 
│ (and 7 more similar warnings elsewhere)
╵

```
**Step**: run
**Success**: :heavy_multiplication_x:
**Details**: `conftest-wrapper`
```
Error: running test: load: loading policies: load: 1 error occurred during loading: stat policy: no such file or directory

```

</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
